"""
Task Manager Project.

Этот проект представляет собой веб-приложение для управления задачами,
предоставляющее пользователям возможность создавать, просматривать,
обновлять и удалять задачи. Основные функции включают:

- Управление задачами (CRUD).
- Аутентификация и авторизация через JWT.
- Управление пользователями.
- API для интеграции с внешними системами.

Технологии:
- Python 3.12
- Django 5.1.2
- Django REST Framework
- Docker и Docker Compose для развертывания
- SQLite для локального использования (по умолчанию)

Этот модуль инициализирует проект и связывает его компоненты.
"""
