"""
Tests Module.

Этот модуль содержит автоматические тесты для проверки функциональности всех компонентов проекта Task Manager.
Основные функции модуля:

- Тестирование API:
  - Проверка маршрутов для пользователей и задач.
  - Тестирование JWT аутентификации.
- Тестирование моделей и логики:
  - Проверка целостности данных в моделях `User` и `Task`.
  - Проверка корректности выполнения бизнес-логики.
- Тестирование административного интерфейса.
- Использование библиотеки pytest для упрощения тестирования.

Структура:
- Тесты разделены по приложениям (`users`, `tasks`).
- Включает конфигурационные файлы (например, `pytest.ini`) для настройки тестирования.

Этот модуль предназначен для обеспечения стабильности и надежности всего проекта.
"""
